<template>
  <div class="polic">
    <div class="title">服務條款</div>
    <div class="close" @click="closeContainer">
      <The_icon icon="x" @click="closePolicy" />
    </div>
    <p class="polic_content">
      親愛的會員您好，非常感謝您使用本網站的服務（以下稱本服務），本網站將根據以下之會員服務條款(以下簡稱本條款)，提供會員便利的服務。為了保障您的權益，請務必詳讀本條款，在您註冊成為本網站會員、或開始使用本服務時，即視為您已經閱讀、瞭解並同意接受本條款及「隱私權保護政策」之所有內容，並視為您已確認詳閱並同意個人資料保護告知暨同意事項。
      如您不同意本條款之全部或部分內容，請勿註冊，並請立即停止使用本服務。本條款之具體約定內容如後：
      一、會員資料 1.
      在您使用本服務之前，必須提供正確個人資料，並加入成為本網站會員，無須支付任何費用；在加入完成後，即可使用本服務及參加與本服務相關之活動。如個人資料有異動，請務必即時更新，以保障您的權益。如因會員未正確更新個人資料，致未能收到本公司寄發之會員權益、消費優惠、活動內容等相關資訊，或變更、終止會員權益、消費優惠、活動內容之通知，會員同意在此情形下，視為會員已經收到該等資訊或通知。
      2. 隱私權保護聲明：會員之個人資料受到本網站隱私權條款之保護與規範。
      二、服務內容的變更 1.
      會員同意本網站得隨時調整、變更、修改或終止本服務及本條款，於本網站公告後生效，不再另行個別通知。
      2.
      會員因參與本網站活動及使用本網站服務，而與本公司所發生之權利義務關係，均以本條款最新修訂之版本為準。
      三、網站個人資料保護告知及暨同意事項
      為提供會員最完善的服務，並保護會員個人資料，本網站謹此依個人資料保護法(下稱個資法)規定，告知您如下事項：
      1. 蒐集之目的、個人資料類別、利用期間、地區、對象及方式
      為提供會員有關本網站各項商品、服務、活動及最新資訊，並有效管理會員資料、進行服務與調查、滿意度及消費統計分析調查(下稱蒐集目的)，本網站將於上開蒐集目的消失前，在完成上開蒐集目的之必要地區內，蒐集、處理、利用您填載於本網站會員申請之個人資料、商品追蹤清單，或日後經您同意而提供之其他個人資料。在上開蒐集目的範圍內，本網站可能會將您全部或部分個人資料，提供予合作廠商。
      2. 注意事項
      您同意以電子文件作為行使個資法書面同意之方式。如您不同意提供個人資料，或要求刪除或停止蒐集、處理您的個人資料，您瞭解本網站可能因此無法進行網路會員資格審核及相關處理作業，或提供您完善的網路服務，尚請見諒。
      四、COOKIE資料
      為了提供您更便利的網站使用體驗，本商店會儲存您的COOKIE資料，您可以於設備瀏覽器中關閉或更改COOKIE存取權限，但您在使用本網站時可能會有限制或部分功能無法使用。
      五、Google Analytics 資料 本商店有安裝Google
      Analytics功能以達到行銷廣告分析、網站優化及產品、活動推廣之目的，您可以於Google停止資料分享，但您可能無法收到最符合您需求的產品活動廣告。
    </p>
  </div>
</template>

<script setup>
import The_icon from "../components/The_icon.vue";

const emit = defineEmits(["close"]);

function closePolicy() {
  emit("close"); // 通知父組件執行關閉
}
</script>

<style lang="scss" scoped>
@import "../assets/colors.scss";
.polic {
  .title {
    font-weight: 600;
    font-size: 1.5rem;
    padding: 10px 0 0 20px;
  }
  position: absolute;
  width: 100%;
  height: 100%;
  background-color: white;
  top: 0;
  overflow: scroll;
  overflow-x: hidden;
  padding: 10px;
  border-radius: 5px;
  .close {
    position: absolute;
    right: 2%;
    top: 3%;
    font-size: 1.5rem;
  }
  .polic_content {
    padding: 20px;
  }
}
</style>
